app/Controllers/KameraController.php

    public function index()
    {
        $data['kamera'] = $this->kamera->findAll();
---
SELECT *
FROM `kamera`