app/Controllers/ModifierController.php

    public function index()
    {
        $data['modifier'] = $this->modifier->findAll();
---
SELECT *
FROM `modifier`