app/Controllers/SearchController.php

SELECT *
FROM `kamera`
WHERE `nama_cam` LIKE '%softbox%' ESCAPE '!'
OR  `kategori_cam` LIKE '%softbox%' ESCAPE '!'
OR  `lok_cam` LIKE '%softbox%' ESCAPE '!'
SELECT *
FROM `lighting`
WHERE `nama_lig` LIKE '%softbox%' ESCAPE '!'
OR  `kategori_lig` LIKE '%softbox%' ESCAPE '!'
OR  `lok_lig` LIKE '%softbox%' ESCAPE '!'
SELECT *
FROM `modifier`
WHERE `nama_mod` LIKE '%softbox%' ESCAPE '!'
OR  `kategori_mod` LIKE '%softbox%' ESCAPE '!'
OR  `lok_mod` LIKE '%softbox%' ESCAPE '!'
---
    public function index()
    {
        $keyword = $this->request->getGet('q');

        if (!$keyword) {
            return view('search/result', [
                'keyword' => '',
                'kamera' => [],
                'lighting' => [],
                'modifier' => []
            ]);
        }

        $data['kamera'] = $this->kamera
            ->like('nama_cam', $keyword)
            ->orLike('kategori_cam', $keyword)
            ->orLike('lok_cam', $keyword)
            ->findAll();

        $data['lighting'] = $this->lighting
            ->like('nama_lig', $keyword)
            ->orLike('kategori_lig', $keyword)
            ->orLike('lok_lig', $keyword)
            ->findAll();

        $data['modifier'] = $this->modifier
            ->like('nama_mod', $keyword)
            ->orLike('kategori_mod', $keyword)
            ->orLike('lok_mod', $keyword)
            ->findAll();